       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEIONO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD         PIC X(80).

       WORKING-STORAGE SECTION.
       01 WS-DONE              PIC 9 VALUE 0.

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE
           READ INPUT-FILE
           CLOSE INPUT-FILE
           DISPLAY "FILE-IO-NOT-SUPPORTED"
           STOP RUN.
