       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOW02.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNTER           PIC 99 VALUE 1.
       01 WS-LIMIT             PIC 99 VALUE 3.
       01 WS-TOTAL             PIC 99 VALUE 0.

       PROCEDURE DIVISION.
           PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > WS-LIMIT
              DISPLAY "HELLO-W02 ITERATION=" WS-COUNTER
              ADD WS-COUNTER TO WS-TOTAL
           END-PERFORM

           DISPLAY "HELLO-W02 TOTAL=" WS-TOTAL
           DISPLAY "HELLO-W02 DONE"
           STOP RUN.
